In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('./pandas-2-data.csv')

In [6]:
df

        name   age   gpa
0   john doe  24.0   2.5
1  alex wong  44.0   3.6
2  james ron  55.0  22.0
3  anne wong  44.0   2.3
4  rex johns  55.0   4.5
5  sea otter   NaN   2.0

In [8]:
df.isnull()

    name    age    gpa
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False   True  False